package Maven_12;

public class maven {

    /*
    * Создано для того что бы можно было легко созавать файлы jar or war и управлять зависимостями (библиотеками)
    * jar -обічные джава приложения
    * war - браузерные
    *
    * jar это как exe
    *
    *И оно само подкючает зависимости(библиотеки)
    *
    *Создаеться отдельно не как обічний джава файл
    *
    * Архитип это какае то структура
    * Мавен имеет дефолтную структуру(дефолтный архетип)
    *
    *
    *
    * */
    public static void main(String[] args) {
        var i=20;
    }
}
